* Terraform initialization

#+BEGIN_SRC sh :results value verbatim
terraform init
#+END_SRC

#+RESULTS:
#+begin_example
Initializing provider plugins...
- Checking for available provider plugins on https://releases.hashicorp.com...
- Downloading plugin for provider "aws" (1.27.0)...
- Downloading plugin for provider "azurerm" (1.9.0)...
- Downloading plugin for provider "google" (1.16.1)...

The following providers do not have any version constraints in configuration,
so the latest version was installed.

To prevent automatic upgrades to new major versions that may contain breaking
changes, it is recommended to add version = "..." constraints to the
corresponding provider blocks in configuration, with the constraint strings
suggested below.

* provider.aws: version = "~> 1.27"
* provider.azurerm: version = "~> 1.9"
* provider.google: version = "~> 1.16"

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
#+end_example
